{
  "0": "No Diabetic Retinopathy - Normal Fundus. \n\n Excellent News! This indicates your current diabetes management is highly effective in protecting your vision. \n\n Advice: This is the ideal result. Focus on sustained, rigorous control of your A1C, blood pressure, and cholesterol. Consistency is key to maintaining this status. Never miss a dose of your prescribed diabetic remedies. Consider incorporating eye-healthy foods rich in Omega-3s and antioxidants. \n\nDuration: Repeat comprehensive, dilated eye exam in 1 year. \n\nAction: No specialist referral is needed for retinopathy. Continue your excellent diabetes care.",
  
  "1": "Mild Diabetic Retinopathy. \n\nEarly Warning: Your eyes show minimal, early changes (like microaneurysms). This is the best stage to intervene with control and prevent worsening. \n\nAdvice: Intensify your diabetes management. Discuss your blood sugar and blood pressure goals with your primary care team—tight control is your primary treatment now. Adhere strictly to your medication, diet, and exercise plan. If you smoke, it is vital to quit, as smoking drastically increases the risk of progression. \n\nDuration: Repeat dilated eye exam and check-up in 6 months. Early re-evaluation is critical. \n\nAction: Monitor closely. No immediate referral unless vision symptoms (e.g., blurriness) develop or if your physician advises otherwise.",
  
  "2": "Moderate Diabetic Retinopathy. \n\nProgression Noted: The damage is now more noticeable, increasing your risk of significant vision loss. It is essential to determine if Diabetic Macular Edema (DME) is present, which requires treatment. \n\nAdvice: You must aggressively manage all systemic factors. This means achieving and maintaining target levels for A1C (often under 7%), blood pressure (often under 130/80 mmHg), and LDL cholesterol. Do not delay your specialist appointment. Preparation for the appointment should include bringing a list of all your medications. \n\nDuration: Follow the specialist's recommended schedule, often every 3 to 4 months, depending on the presence of DME. \n\nAction: Refer to a specialist (Ophthalmologist/Retina Specialist) for a detailed evaluation, including an OCT scan, to guide treatment planning and prevent further vision damage.",
  
  "3": "Severe Diabetic Retinopathy. \n\nHigh Risk: The retina is significantly compromised, placing you at a very high risk of developing the vision-threatening PDR stage. Intervention is often necessary to stabilize the condition. \n\nAdvice: This is a clear signal that your body requires more intensive medical management. The risk of major complications, like vitreous hemorrhage, is high. Strict adherence to treatment plans is non-negotiable. If you notice any sudden change in vision, such as floaters or a 'curtain' over your eye, seek emergency care immediately. \n\nDuration: Frequent follow-up, typically every 1 to 3 months, as determined by the specialist based on treatment response. \n\nAction: URGENT referral to a Retina Specialist. They will assess the need for immediate stabilizing treatments like Panretinal Photocoagulation (PRP) laser surgery or anti-VEGF injections to prevent new, fragile blood vessels from forming.",
  
  "4": "Proliferative Diabetic Retinopathy (PDR). \n\nVision Emergency: This is the most advanced and dangerous stage. New, abnormal blood vessels are actively growing, which can bleed or pull on the retina, causing permanent blindness. Immediate action is critical. \n\nAdvice: Do NOT postpone your specialist appointment. Your primary focus must be on stabilization and treatment. You will require specialized procedures (laser, injections, or possibly vitrectomy surgery) to save your vision. Maintain clear communication with both your endocrinologist/PCP and your eye specialist, as they must coordinate care. \n\nDuration: Immediate specialist consultation required. Follow-up will be intense and frequent until the condition is stabilized, often weekly or bi-weekly initially. \n\nAction: IMMEDIATE referral to a Retina Specialist. Be prepared for a treatment plan that may include multiple sessions of anti-VEGF injections and/or extensive laser treatment (PRP) to regress the abnormal vessels and protect against retinal detachment."
}
